---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueLuminanceModifier
source: html/72ae5b7f-66b7-e2df-fa64-2e69926ad4d4.htm
---
# Autodesk.Revit.DB.Visual.AdvancedOpaque.OpaqueLuminanceModifier Property

The property labeled "Luminance Scale" from the "AdvancedOpaque" schema.

## Syntax (C#)
```csharp
public static string OpaqueLuminanceModifier { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.